read_verilog -sv ADD.v
prep -top ADD

hierarchy -check
proc
chformal -assume -early;

select ADD
chformal -remove
select *

memory ;
flatten
setundef -undriven -expose;
sim -clock clk -reset rst -rstlen 1 -n 1 -w wrapper
write_btor  -s add.btor2
